<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
	<head>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
		<title>Restaurar Backup</title>
		<style type="text/css">
			<!--
				.style3 {font-family: Tahoma; font-size: 8.5pt; line-height: 1.5;}
				.style6 {font-family: Tahoma; font-size: 8.5pt; font-weight: bold; line-height: 1.5;}
				
				body,td,th {
					font-family: Tahoma;
					font-size: 8.5pt;
					line-height: 1.5;
				}
				a {
					font-family: Tahoma;
					line-height: 1.5;
				}
				-->
		</style>
	</head>
	<body>
		<p align="left" class="style6">Restaurar Backup </p>
		<p align="justify" class="style3"><strong>Onde encontrar</strong>:<br />
			<a href="menu_principal.htm">Menu Principal</a> -&gt; <a href="menu_backup_restore.htm">Backup</a> -&gt; Restaurar backup anterior...
		</p>
		<p align="justify" class="style3"><strong>Descri&ccedil;&atilde;o</strong>:<br />
			Faz a restaura&ccedil;&atilde;o de um backup da base de dados.
		</p>
		<p align="justify" class="style6">Como proceder para restaurar um backup existente: </p>
		<p align="justify" class="style3">1) Ao selecionar o menu, a tela abaixo ser&aacute; exibida. Para iniciar o processo, o usu&aacute;rio deve clicar no bot&atilde;o <strong>[...]</strong>. <br />
			<img src="img/backup_restore_01.png" />
		</p>
		<p align="justify" class="style3">2) Em seguida, selecione o arquivo de backup que deseja restaurar.<br />
			<img src="img/backup_restore_02.png" />
		</p>
		<p align="justify" class="style3">3) Ap&oacute;s a sele&ccedil;&atilde;o do arquivo, digite a senha do usu&aacute;rio que realizou o backup. Em seguida, clique <strong>Restaurar (F2)</strong>. <br />
			<img src="img/backup_restore_03.png" />
		</p>
		<p align="justify" class="style3">4) A aplica&ccedil;&atilde;o emitir&aacute; um aviso sobre o conte&uacute;do da base atual. Clique em <strong>Sim</strong> para continuar ou <strong>N&atilde;o</strong> para cancelar. <br />
			<img src="img/backup_restore_04.png" />
		</p>
		<p align="justify" class="style3">5) Uma vez iniciada a restaura&ccedil;&atilde;o do backup, basta apenas que o usu&aacute;rio aguarde a conclus&atilde;o do processo. <br />
			<img src="img/backup_restore_05.png" />
		</p>
		<p align="justify" class="style3">6) Depois do t&eacute;rmino da restaura&ccedil;&atilde;o, basta clicar em Ok. Pronto! Os dados foram restaurados.
			<br />
			<img src="img/backup_restore_06.png" />
		</p>
		<p align="justify" class="style3"><strong>Itens da tela </strong>:<br />
			Backup a restaurar: Arquivo selecionado para restaura&ccedil;&atilde;o.<br />
			Usu&aacute;rio: Usu&aacute;rio que criou o arquivo de backup.<br />
			Data do backup selecionado: Exibe a data e hora de quando foi realizado o backup.<br />
			Senha: Campo para inser&ccedil;&atilde;o da senha do usu&aacute;rio que criou o backup.
			<br />
			Log de opera&ccedil;&otilde;es: Exibe uma lista detalhada das opera&ccedil;&otilde;es realizadas no momento.
		</p>
		<p align="justify" class="style3"><strong>Comandos da tela </strong>:<br />
			[...]: Abre a tela para sele&ccedil;&atilde;o do arquivo a restaurar.<br />
			Restaurar: Faz as valida&ccedil;&otilde;es necess&aacute;rias e inicia o processo de restaura&ccedil;&atilde;o.<br />
			Cancelar: Cancela o processo sem restaurar a base de dados.
		</p>
		<p align="justify" class="style3"><strong>Barras de progresso  </strong>:<br />
			Acima: Exibe o progresso geral da opera&ccedil;&atilde;o.<br />
			Abaixo: Exibe o progresso do item individual.
		</p>
		<p align="justify" class="style3"><strong>Observa&ccedil;&otilde;es</strong>:<br />
			Somente o usu&aacute;rio que criou o backup da base selecionada pode restaur&aacute;-la, ou seja,<strong> n&atilde;o &eacute; poss&iacute;vel</strong> restaurar uma base de dados de um usu&aacute;rio para outro. <br />
			O tempo deste processo pode variar de acordo com o tamanho da base de dados.<br />
			Esta tela s&oacute; poder&aacute; ser fechada ap&oacute;s a conclus&atilde;o do processo. <br />
		</p>
	</body>
</html>