<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
	<head>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
		<title>Formas de Pagamento</title>
		<style type="text/css">
			<!--
				.style3 {font-family: Tahoma; font-size: 8.5pt; line-height: 1.5;}
				.style6 {font-family: Tahoma; font-size: 8.5pt; font-weight: bold; line-height: 1.5;}
				
				body,td,th {
					font-family: Tahoma;
					font-size: 8.5pt;
					line-height: 1.5;
				}
				a {
					font-family: Tahoma;
					line-height: 1.5;
				}
				-->
		</style>
	</head>
	<body>
		<p align="left" class="style6">Formas de Pagamento </p>
		<p align="justify" class="style3"><strong>Onde encontrar</strong>:<br />
			<a href="menu_principal.htm">Menu Principal</a> -&gt; <a href="menu_cadastros.htm">Cadastros</a> -&gt; Formas de Pagamento.
		</p>
		<p align="justify" class="style3"><strong>Descri&ccedil;&atilde;o</strong>:<br />
			Abre a janela para a manuten&ccedil;&atilde;o de formas de pagamento utilizadas na aplica&ccedil;&atilde;o.
		</p>
		<p align="justify" class="style3"><strong>Imagem da tela</strong>:<br />
			<img src="img/cadastros_formas_pagamento.png" />
		</p>
		<p align="justify" class="style3"><strong>Itens da tela </strong>:<br />
			Formas de Pagamento: Lista que cont&eacute;m todas as formas de pagamento cadastradas. <br />
			Ativo: Exibe se a conta forma de pagamento est&aacute; ativa ou n&atilde;o.<br />
			Forma de Pagamento: Descri&ccedil;&atilde;o da forma de pagamento selecionada.<br />
			Observa&ccedil;&otilde;es: Exibe as observa&ccedil;&otilde;es da forma de pagamento selecionada.
		</p>
		<p align="justify" class="style3"><strong>Comandos da tela </strong>:<br />
			Inserir: Limpa a tela para inser&ccedil;&atilde;o de uma nova forma de pagamento.<br />
			Editar: Permite editar informa&ccedil;&otilde;es da forma de pagamento selecionada.<br />
			Salvar: Grava as informa&ccedil;&otilde;es.<br />
			Cancelar: Cancela todas as altera&ccedil;&otilde;es realizadas.
			<br />
			Excluir: Exclui uma forma de pagamento selecionada.<br />
			Atualizar: Recarrega os dados da tela.<br />
			Fechar: Fecha a janela de cadastro de formas de pagamento. 
		</p>
		<p align="justify" class="style3"><strong>Menu de contexto</strong>:<br />
			Formas de Pagamento: Ao clicar com o bot&atilde;o direito do mouse na lista de formas de pagamento, ser&atilde;o exibidas as seguintes op&ccedil;&otilde;es:<br />
			- Copiar conte&uacute;do: Copia o conte&uacute;do da lista para a &aacute;rea de transfer&ecirc;ncia.<br />
			- Exportar para arquivo: Permite exportar o conte&uacute;do da lista para um arquivo do tipo texto (*.txt) ou csv (*.csv).
		</p>
		<p align="justify" class="style3"><strong>Observa&ccedil;&otilde;es</strong>:<br />
			Inserir/Editar: Ao selecionar esta op&ccedil;&atilde;o, os bot&otilde;es salvar/cancelar ser&atilde;o habilitados e os demais desabilitados.<br />
			Excluir: Se houver movimenta&ccedil;&atilde;o com a forma de pagamento selecionada, a aplica&ccedil;&atilde;o n&atilde;o permitir&aacute; que a mesma seja exclu&iacute;da.
			<br />
			Ativo: Permite ativar/desativar uma forma de pagamento. Ao desativar uma forma de pagamento, a mesma ficar&aacute; indispon&iacute;vel para movimenta&ccedil;&otilde;es futuras.<br />
			Observa&ccedil;&otilde;es: Quaisquer dados que o usu&aacute;rio deseje colocar a mais, apenas como refer&ecirc;ncia de consulta. 
		</p>
	</body>
</html>