<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
	<head>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
		<title>Configura&ccedil;&otilde;es</title>
		<style type="text/css">
			<!--
				.style3 {font-family: Tahoma; font-size: 8.5pt; line-height: 1.5;}
				.style6 {font-family: Tahoma; font-size: 8.5pt; font-weight: bold; line-height: 1.5;}
				
				body,td,th {
					font-family: Tahoma;
					font-size: 8.5pt;
					line-height: 1.5;
				}
				a {
					font-family: Tahoma;
					line-height: 1.5;
				}
				-->
		</style>
	</head>
	<body>
		<p align="left" class="style6">Configura&ccedil;&otilde;es</p>
		<p align="justify" class="style3"><strong>Onde encontrar</strong>:<br />
			<a href="menu_principal.htm">Menu Principal</a> -&gt; Configura&ccedil;&otilde;es.
		</p>
		<p align="justify" class="style3"><strong>Descri&ccedil;&atilde;o</strong>:<br /> 
			Permite ao usu&aacute;rio ajustar as configura&ccedil;&otilde;es da aplica&ccedil;&atilde;o.
		</p>
		<p align="justify" class="style3"><strong>Imagem da tela</strong>:<br />
			<img src="img/configuracoes.png"/>
		</p>
		<p align="justify" class="style3"><strong>Itens da tela </strong>:<br />
			- <em>Banco de dados</em>: <br />
			&nbsp;&nbsp;&nbsp; - Permite ajustar configura&ccedil;&otilde;es de backup da base de dados da aplica&ccedil;&atilde;o.<br />
			&nbsp;&nbsp;&nbsp; - Per&iacute;odo: Define se  backup ser&aacute; realizado diariamente, semanal, quinzenal ou mensal.<br />
			&nbsp;&nbsp;&nbsp; - Ativar backup do banco: Selecione esta op&ccedil;&atilde;o para que os backups sejam realizados automaticamente.<br />
			&nbsp;&nbsp;&nbsp; - Pasta para backup [...]: Local onde a aplica&ccedil;&atilde;o ir&aacute; gravar o arquivo de backup, definido pelo usu&aacute;rio.<br />
			- <em>Moeda</em>:<br />
			&nbsp;&nbsp;&nbsp; - Permite ao usu&aacute;rio selecionar moedas como Real, Euro, D&oacute;lar e Yene.<br />
			- <em>Data</em>:<br />
			&nbsp;&nbsp;&nbsp; - Define o per&iacute;odo de intervalo de data utilizado na aplica&ccedil;&atilde;o.<br />
			- <em>Configura&ccedil;&otilde;es gerais</em>:<br />
			&nbsp;&nbsp;&nbsp; - Carregar agenda financeira no Login: permite ao usu&aacute;rio ativar ou desativar o carregamento da agenda financeira ao fazer o login na aplica&ccedil;&atilde;o. <br /> 
			&nbsp;&nbsp;&nbsp; - Permitir lan&ccedil;amentos retroativos: permite ao usu&aacute;rio fazer um lan&ccedil;amento em uma data anterior &agrave; atual.<br />
			&nbsp;&nbsp;&nbsp; - N&atilde;o permitir lan&ccedil;amentos duplicados: faz com que a aplica&ccedil;&atilde;o impe&ccedil;a o usu&aacute;rio de baixar na movimenta&ccedil;&atilde;o lan&ccedil;amentos duplicados *. <br /> 
			&nbsp;&nbsp;&nbsp; - Permitir altera&ccedil;&otilde;es de detalhes (movimenta&ccedil;&atilde;o): possibilita que o usu&aacute;rio altere lan&ccedil;amentos j&aacute; realizados.<br />
			&nbsp;&nbsp;&nbsp; - Considerar data de vencimento na baixa imediata: faz com que a aplica&ccedil;&atilde;o grave a data selecionada ao inv&eacute;s da data do sistema operacional para os campos vencimento e pagamento (<a href="financeiro_contas_pagar_lancar.htm">contas a pagar</a>/<a href="financeiro_contas_receber_lancar.htm">contas a receber</a>). 
		</p>
		<p align="justify" class="style3"><strong>Comandos da tela </strong>:<br />
			Aplicar: Faz a valida&ccedil;&atilde;o das op&ccedil;&otilde;es selecionadas e, em seguida, grava as configura&ccedil;&otilde;es.<br />
			Cancelar: Fecha a tela de configura&ccedil;&otilde;es, descartando todas as altera&ccedil;&otilde;es realizadas. 
		</p>
		<p align="justify" class="style3"><strong>Observa&ccedil;&otilde;es</strong>:<br />
			- As configura&ccedil;&otilde;es s&atilde;o aplicadas imediatamente, n&atilde;o sendo necess&aacute;rio reiniciar a aplica&ccedil;&atilde;o.<br />
			* Lan&ccedil;amentos duplicados s&atilde;o aqueles que cont&eacute;m o mesmo valor, documento e data de pagamento ou vencimento iguais.
		</p>
	</body>
</html>