<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
	<head>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
		<title>Contas a Receber</title>
		<style type="text/css">
			<!--
				.style3 {font-family: Tahoma; font-size: 8.5pt; line-height: 1.5;}
				.style6 {font-family: Tahoma; font-size: 8.5pt; font-weight: bold; line-height: 1.5;}
				
				body,td,th {
					font-family: Tahoma;
					font-size: 8.5pt;
					line-height: 1.5;
				}
				a {
					font-family: Tahoma;
					line-height: 1.5;
				}
				-->
		</style>
	</head>
	<body>
		<p align="left" class="style6">Contas a Receber  </p>
		<p align="justify" class="style3"><strong>Onde encontrar</strong>:<br />
			<a href="menu_principal.htm">Menu Principal</a> -&gt; <a href="menu_financeiro.htm">Financeiro</a> -&gt; Contas a Receber.
		</p>
		<p align="justify" class="style3"><strong>Descri&ccedil;&atilde;o</strong>:<br />
			Exibe uma lista de contas a receber  de acordo com os filtros selecionados.
		</p>
		<p align="justify" class="style3"><strong>Imagem da tela</strong>:<br />
			<img src="img/financeiro_contas_receber.png" />
		</p>
		<p align="justify" class="style3"><strong>Itens da tela </strong>:<br />
			- Filtros:
			<br />
			&nbsp;&nbsp;&nbsp;&nbsp;- Exibir de/at&eacute;: Define o per&iacute;odo a ser visualizado.<br />
			&nbsp;&nbsp;&nbsp;&nbsp;- Ordenar por: Define o campo que ser&aacute; utilizado para ordena&ccedil;&atilde;o do resultado.<br />
			&nbsp;&nbsp;&nbsp;&nbsp;- Em ordem: Tipo da ordem, crescente ou decrescente.<br />
			- Rodap&eacute;:<br />
			&nbsp;&nbsp;&nbsp;&nbsp;- Exibe o per&iacute;odo selecionado, a quantidade de itens filtrados e o valor total a ser pago, de acordo com o filtro selecionado.
		</p>
		<p align="justify" class="style3"><strong>Comandos da tela </strong>:<br />
			<a href="financeiro_contas_receber_lancar.htm">Lan&ccedil;ar</a>: Abre uma nova tela que permite realizar novos lan&ccedil;amentos de contas a receber.<br />
			Cancelar: Cancela a conta a receber selecionada na grade.<br />
			<a href="financeiro_contas_receber_baixar.htm">Baixar</a>: Abre uma nova tela que permite dar a baixa da conta a receber selecionada.<br />
			Filtrar: Exibe a lista de contas a receber de acordo com os filtros selecionados. <br />
			Fechar: Fecha a janela de Contas a Receber. 
		</p>
		<p align="justify" class="style3"><strong>Menu de contexto</strong>:<br />
			Lista de contas a receber: Ao clicar com o bot&atilde;o direito do mouse na lista de contas a receber, ser&atilde;o exibidas as seguintes op&ccedil;&otilde;es:<br />
			- Copiar conte&uacute;do: Copia o conte&uacute;do da lista para a &aacute;rea de transfer&ecirc;ncia.<br />
			- Exportar para arquivo: Permite exportar o conte&uacute;do da lista para um arquivo do tipo texto (*.txt) ou csv (*.csv).
		</p>
		<p align="justify" class="style3"><strong>Observa&ccedil;&otilde;es</strong>:<br />
			- Ao cancelar uma conta a receber, a aplica&ccedil;&atilde;o ir&aacute; verificar se a mesma faz parte de um lan&ccedil;amento m&uacute;ltiplo. Caso positivo, ser&aacute; exibida uma mensagem alertando o usu&aacute;rio desta situa&ccedil;&atilde;o, por&eacute;m, mesmo que seja realizado um cancelamento m&uacute;ltiplo, a aplica&ccedil;&atilde;o n&atilde;o ir&aacute; cancelar os itens que j&aacute; foram baixados.
		</p>
	</body>
</html>