<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
	<head>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
		<title>Baixar Contas a Receber</title>
		<style type="text/css">
			<!--
				.style3 {font-family: Tahoma; font-size: 8.5pt; line-height: 1.5;}
				.style6 {font-family: Tahoma; font-size: 8.5pt; font-weight: bold; line-height: 1.5;}
				
				body,td,th {
					font-family: Tahoma;
					font-size: 8.5pt;
					line-height: 1.5;
				}
				a {
					font-family: Tahoma;
					line-height: 1.5;
				}
				-->
		</style>
	</head>
	<body>
		<p align="left" class="style6">Baixar Contas a Receber </p>
		<p align="justify" class="style3"><strong>Onde encontrar</strong>:<br />
			<a href="menu_principal.htm">Menu Principal</a> -&gt; <a href="menu_financeiro.htm">Financeiro</a> -&gt; <a href="financeiro_contas_receber.htm">Contas a Receber</a> -&gt; Baixar
		</p>
		<p align="justify" class="style3"><strong>Descri&ccedil;&atilde;o</strong>:<br />
			Permite realizar a baixa de uma conta a receber lan&ccedil;ada anteriormente.
		</p>
		<p align="justify" class="style3"><strong>Imagem da tela</strong>:<br />
			<img src="img/financeiro_contas_receber_baixar.png" width="364" height="397" />
		</p>
		<p align="justify" class="style3"><strong>Itens da tela </strong>:<br />
			Lan&ccedil;ar na conta: Permite selecionar a conta na qual ser&aacute; dada a baixa. <br />
			Vencimento: Data de vencimento do lan&ccedil;amento.<br />
			Descri&ccedil;&atilde;o: Descri&ccedil;&atilde;o do lan&ccedil;amento.<br />
			Tipo de receita: Permite selecionar qual receita ser&aacute; utilizada na baixa.<br />
			Valor: Valor do lan&ccedil;amento.<br />
			Forma de pagamento: Permite selecionar qual forma de pagamento ser&aacute; utilizada na baixa.
			<br />
			Documento: Documento do lan&ccedil;amento.<br />
			Observa&ccedil;&otilde;es: Observa&ccedil;&otilde;es do lan&ccedil;amento, ou seja, quaisquer dados que o usu&aacute;rio deseje colocar a mais, apenas como refer&ecirc;ncia.
		</p>
		<p align="justify" class="style3"><strong>Comandos da tela </strong>:<br />
			Baixar: Faz a valida&ccedil;&atilde;o dos dados inseridos nos campos e, em seguida, realiza a baixa da conta a receber.
			<br />
			Cancelar: Cancela todas as altera&ccedil;&otilde;es realizadas fechando a janela posteriormente.
		</p>
		<p align="justify" class="style3"><strong>Observa&ccedil;&otilde;es</strong>:<br />
			- Antes de realizar a baixa, a aplica&ccedil;&atilde;o verificar&aacute; se a data do vencimento &eacute; inferior &agrave; data atual. Caso positivo, ser&aacute; emitido um aviso informando que n&atilde;o &eacute; poss&iacute;vel realizar a baixa com data de vencimento retroativa. Este comportamento pode ser alterado na tela de <a href="configuracoes.htm">configura&ccedil;&otilde;es</a>, selecionando a op&ccedil;&atilde;o [Permitir lan&ccedil;amentos retroativos]. <br />
			- Caso a op&ccedil;&atilde;o [N&atilde;o permitir lan&ccedil;amentos duplicados] esteja marcada na tela de <a href="configuracoes.htm">configura&ccedil;&otilde;es</a>, o sistema ir&aacute; verificar se j&aacute; existe baixada na movimenta&ccedil;&atilde;o algum registro com o mesmo valor, mesmo documento e data de pagamento ou vencimento iguais. Se positivo, o sistema ir&aacute; impedir que a baixa seja feita. Do contr&aacute;rio, a baixa ser&aacute; feita normalmente. 
		</p>
	</body>
</html>