<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
	<head>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
		<title>Introdução</title>
		<style type="text/css">
			<!--
				.style3 {font-family: Tahoma; font-size: 8.5pt; line-height: 1.5;}
				.style6 {font-family: Tahoma; font-size: 8.5pt; font-weight: bold; line-height: 1.5;}
				
				body,td,th {
					font-family: Tahoma;
					font-size: 8.5pt;
					line-height: 1.5;
				}
				a {
					font-family: Tahoma;
					line-height: 1.5;
				}
				-->
		</style>
	</head>
	<body>
		<p align="left" class="style6">Introdu&ccedil;&atilde;o</p>
		<p align="justify" class="style3">Ol&aacute; amigo(o), seja bem vindo(a) ao Eiko Finan&ccedil;as Pessoais. Nesta p&aacute;gina voc&ecirc; encontrar&aacute; algumas informa&ccedil;&otilde;es interessantes a respeito do que &eacute; esta aplica&ccedil;&atilde;o, bem como as raz&otilde;es de ter sido desenvolvida e motivos de hoje estar sendo disponibilizada gratuitamente na internet como free-software (gratuito).</p>
		<p align="justify" class="style6">Um breve hist&oacute;rico...</p>
		<p align="justify" class="style3">O &quot;Eiko Finan&ccedil;as Pessoais&quot; &eacute; uma aplica&ccedil;&atilde;o simples, destinada ao gerenciamento de pequenas finan&ccedil;as, ou seja, com poucos recursos dispon&iacute;veis. No in&iacute;cio, este projeto surgiu como uma brincadeira, um passatempo. Eu trabalhava numa f&aacute;brica de software na &eacute;poca e, no &iacute;nicio daquele projeto, n&oacute;s desenvolvedores fic&aacute;vamos muito tempo ociosos, por n&atilde;o ter realmente atividade para n&oacute;s naquele dado momento. E como eu n&atilde;o gosto de ficar sem ter o que fazer, comecei a pensar no que eu poderia fazer para me ocupar.</p>
		<p align="justify" class="style3">Depois de alguns minutos pensando, pensei: <br />
			- &quot;Porque n&atilde;o procurar uma aplica&ccedil;&atilde;o para fazer um gerenciamento de minhas finan&ccedil;as?&quot;
		</p>
		<p align="justify" class="style3">Comecei ent&atilde;o, a procurar por aplica&ccedil;&otilde;es de finan&ccedil;as gratuitas e conforme fui encontrando, fui baixando, instalando, testando e analisando uma a uma, para encontrar aquela que se encaixasse na minha expectativa. No final das contas, ap&oacute;s uma semana inteira nisso, perdi as esperan&ccedil;as de encontrar algo que eu esperava, ou seja, simples. Todas eram aplica&ccedil;&otilde;es muito complicadas, com muitos detalhes e dotadas de parafern&aacute;lias infind&aacute;veis de recursos que eu tinha certeza absoluta que jamais iria utilizar.</p>
		<p align="justify" class="style3">Depois de uns dias, ao olhar o extrato banc&aacute;rio, pensei:<br />
			- &quot;Porque n&atilde;o desenvolver uma aplica&ccedil;&atilde;o pra mim, do meu jeito?&quot;
		</p>
		<p align="justify" class="style3">Foi a&iacute; que come&ccedil;ou a brincadeira. Trabalhando como desenvolvedor numa f&aacute;brica de software, comecei a pegar uma id&eacute;ia aqui, outra ali e assim a aplica&ccedil;&atilde;o nasceu. Foi crescendo pouco a pouco e os recursos foram implementados conforme eu fosse precisando. Depois de um bom tempo desenvolvendo, a aplica&ccedil;&atilde;o j&aacute; estava pronta para entrar em fase de testes. Entretanto, na &eacute;poca, devido &agrave; falta de tempo, os testes nunca foram realizados e aplica&ccedil;&atilde;o ficou abandonada por um tempo.</p>
		<p align="justify" class="style3">No in&iacute;cio (e atualmente) a aplica&ccedil;&atilde;o foi constru&iacute;da em Visual Basic 6 &trade;. O banco de dados utilizado na &eacute;poca era o Access &trade;, ou seja, arquivos MDB. Por&eacute;m, conforme a aplica&ccedil;&atilde;o foi crescendo, os arquivos MDB se tornaram invi&aacute;veis e a&iacute;, surgiu um problema. O banco de dados obrigatoriamente, teria de ser mudado. E uma vez que o banco de dados fosse mudado, uma boa parte da aplica&ccedil;&atilde;o teria que ser reescrita.</p>
		<p align="justify" class="style3">Alguns dias depois, escolhi o SQL Server &trade; 2005 Express. Gratuito por&eacute;m, mais pesado que o Access &trade;, infelizmente. Depois de um tempo reescrevendo o que era necess&aacute;rio para a aplica&ccedil;&atilde;o rodar com o novo banco de dados, importei os dados da base antiga e iniciei a fase de testes. Obviamente erros apareceram e foram corrigidos pouco a pouco. O meu tempo era escasso na &eacute;poca e isso ocasionou uma demora maior para que a aplica&ccedil;&atilde;o entrasse em fase de produ&ccedil;&atilde;o.</p>
		<p align="justify" class="style3">Foi naquele momento que comecei a utilizar meu pr&oacute;prio programa. A vers&atilde;o da &eacute;poca ent&atilde;o continha algumas funcionalidades, dentre as quais eram:</p>
		<p align="justify" class="style3">- Cadastro de contas<br />
			- Cadastro de receitas<br />
			- Cadastro de despesas<br />
			- Cadastro de formas de pagamento<br />
			- Contas a pagar<br />
			- Contas a receber<br />
			- Agenda financeira<br />
			- Movimenta&ccedil;&atilde;o
		</p>
		<p align="justify" class="style3">N&atilde;o havia at&eacute; ent&atilde;o autentica&ccedil;&atilde;o por usu&aacute;rio e senha na aplica&ccedil;&atilde;o. Qualquer um que operasse a m&aacute;quina teria acesso &agrave;s minhas finan&ccedil;as. Era s&oacute; abrir o programa e tudo estava l&aacute;, na tela para ser visualizado. E como eu n&atilde;o queria que isso acontecesse, posteriormente, foi implementado um cadastro de usu&aacute;rio simples. Este obrigava o usu&aacute;rio a se autenticar antes de ter acesso aos dados.</p>
		<p align="justify" class="style3">Surgiu ent&atilde;o, um outro problema. A aplica&ccedil;&atilde;o n&atilde;o tinha sido constru&iacute;da para suportar v&aacute;rios usu&aacute;rios. Mesmo com o cadastro de usu&aacute;rios implementado, todos tinham acesso aos mesmos dados. Obviamente, boa parte da aplica&ccedil;&atilde;o teve de ser reescrita e a estrutura da base de dados tamb&eacute;m foi modificada. Depois de tudo pronto, mais uma pequena fase de testes e aparentemente, tudo estava funcionando perfeitamente bem.</p>
		<p align="justify" class="style3">Muuuito tempo depois, um conhecido sugeriu implementar gr&aacute;ficos na aplica&ccedil;&atilde;o. Ent&atilde;o, um gr&aacute;fico foi implementado como piloto, para vermos como ficava. Ambos gostamos do resultado e o mesmo gr&aacute;fico passou a fazer parte da aplica&ccedil;&atilde;o. Surgiu ent&atilde;o, outra necessidade. Eu precisava de um comparativo, de receitas x despesas em um determinado per&iacute;odo, para ter uma id&eacute;ia melhor de como eu estava movimentando o meu dinheiro. Essa solu&ccedil;&atilde;o ent&atilde;o, foi implementada, testada, gostei do resultado e agora faz parte da aplica&ccedil;&atilde;o tamb&eacute;m. :)</p>
		<p align="justify" class="style3">O programa estava rodando legal, tudo estava funcionando muito bem e n&atilde;o havia problemas conhecidos at&eacute; ent&atilde;o. Posteriormente, foi iniciada uma nova fase de produ&ccedil;&atilde;o. Com o tempo, fui mostrando a aplica&ccedil;&atilde;o para algumas pessoas. Algumas se ofereceram para compr&aacute;-la pois acharam uma solu&ccedil;&atilde;o bastante interessante, mesmo sendo relativamente simples. Eis ent&atilde;o que surgiu o maior de todos os problemas at&eacute; o momento: Distribuir a aplica&ccedil;&atilde;o. Mas, se tudo estava perfeito, qual era o problema?</p>
		<p align="justify" class="style3">Simples, simples, simples. O banco de dados. :(</p>
		<p align="justify" class="style3">Naquela altura, a aplica&ccedil;&atilde;o criava automaticamente a base de dados, as tabelas e tudo mais que fosse necess&aacute;rio para rodar no SQL Server &trade; 2005 Express. Mas, se a aplica&ccedil;&atilde;o criava tudo sozinha, qual era o problema afinal?? Instalar o servidor de banco de dados e configur&aacute;-lo de forma correta. Para quem &eacute; desenvolvedor como eu, isso &eacute; uma tarefa das mais simples, por&eacute;m, para um usu&aacute;rio que nunca viu isso na vida, seria uma tarefa bastante complexa.</p>
		<p align="justify" class="style3">Infelizmente, devido a tudo isso, fui obrigado a dizer a estas pessoas que, naquele momento, n&atilde;o era poss&iacute;vel distribuir a aplica&ccedil;&atilde;o. Mesmo sendo sincero e explicando a real situa&ccedil;&atilde;o, muitas perderam o interesse e desistiram de utiliz&aacute;-la. At&eacute; a&iacute;, muito mais do que &oacute;bvio. Como vou usar uma aplica&ccedil;&atilde;o se &eacute; dif&iacute;cil at&eacute; para instalar? Eis que surgiu um novo desafio, como fazer um pacote de instala&ccedil;&atilde;o simplificado?</p>
		<p align="justify" class="style3">Procurei durante algum tempo uma solu&ccedil;&atilde;o para isso. Encontrei? Sim, por&eacute;m, era totalmente invi&aacute;vel, pois a aplica&ccedil;&atilde;o que era simples, ao ser instalada junto com o banco de dados, chegava a ter mais de 60 MB s&oacute; o instalador! E convenhamos, para uma aplica&ccedil;&atilde;o desse porte, 60 MB &eacute; exagero demais da conta. Continuei ent&atilde;o utilizando minha aplica&ccedil;&atilde;o e deixei de lado a id&eacute;ia de distribu&iacute;-la durante um tempo.</p>
		<p align="justify" class="style3">Alguns meses depois, conheci um banco de dados que nem sabia de sua exist&ecirc;ncia, o SQLite &trade;. E o melhor? &Eacute; gr&aacute;tis. Fui at&eacute; o site do projeto, baixei os arquivos necess&aacute;rios, fiz v&aacute;rios testes e obtive resultados bastante satisfat&oacute;rios. Todos os recursos que eu utilizava no SQL Server &trade; eram ent&atilde;o suportados pelo SQLite &trade;, al&eacute;m de n&atilde;o ter os mesmos problemas que enfrentei na &eacute;poca com o Access &trade;.</p>
		<p align="justify" class="style3">Legal, gostei. Mas e a&iacute;? E a&iacute; que surgiu um outro problema. :(</p>
		<p align="justify" class="style3">At&eacute; ent&atilde;o, n&atilde;o havia nenhuma biblioteca compat&iacute;vel com Visual Basic 6 &trade; para acesso ao SQLite &trade;. Alguns meses depois, quando eu j&aacute; havia desistido da id&eacute;ia totalmente, numa madrugada fria, eu estava sem sono, levantei e resolvi vir at&eacute; o micro dar uma navegada na internet. Para minha surpresa, sem querer, achei um site de um projeto que havia criado uma biblioteca que pudesse ser utilizada com o Visual Basic 6 &trade; para acesso ao SQLite e ainda, gratuita! Yes, yes, yes! :D</p>
		<p align="justify" class="style3">Imediatamente eu fiz o download do conte&uacute;do necess&aacute;rio, inclusive peguei at&eacute; alguns exemplos de como usar a biblioteca. Na manh&atilde; seguinte, ap&oacute;s acordar e tomar aquele delicioso caf&eacute; da manh&atilde;, resolvi dar uma olhada no que tinha achado, para ver se era realmente o que eu precisava e bingo! Tinha tudo o que eu precisava e mais um pouco. Peguei os exemplos, fiz uma verdadeira bateria de testes. Realmente, agora era poss&iacute;vel usar o SQLite &trade; na minha aplica&ccedil;&atilde;o.</p>
		<p align="justify" class="style3">Decidi que, n&atilde;o iria somente portar a aplica&ccedil;&atilde;o para o novo banco de dados. Eu queria criar algo novo, est&aacute;vel, por&eacute;m, sem alterar o visual que j&aacute; tinha criado. E assim foi durante aproximadamente dois meses. A aplica&ccedil;&atilde;o foi quase que totalmente reescrita e hoje ela inclui v&aacute;rias funcionalidades novas que, a princ&iacute;pio, nunca existiriam pois n&atilde;o eram necess&aacute;rias com o SQL Server &trade;. </p>
		<p align="justify" class="style3">Para testar, importei a minha base de dados do SQL Server &trade; para o SQLite &trade;. Devido &agrave; quantia de dados ser relativamente consider&aacute;vel, serviu tamb&eacute;m para realizar testes de performance. Al&eacute;m de estar mais leve, a aplica&ccedil;&atilde;o tamb&eacute;m est&aacute; muito mais r&aacute;pida do que era antes. Toda a aplica&ccedil;&atilde;o foi testada novamente. Todos os testes foram satisfat&oacute;rios e os erros que foram encontrados foram corrigidos. Mesmo ap&oacute;s a corre&ccedil;&atilde;o dos erros, todos os testes foram refeitos, para certificar-me de que tudo est&aacute; funcionando perfeitamente.</p>
		<p align="justify" class="style3">E para esta vers&atilde;o, foi inclu&iacute;do tamb&eacute;m um arquivo de ajuda. Neste arquivo voc&ecirc; encontrar&aacute; explica&ccedil;&otilde;es de como funciona a aplica&ccedil;&atilde;o bem de como utilizar seus recursos. H&aacute; tamb&eacute;m um <a href="ajuda_tutorial.htm">tutorial</a>, caso tenha d&uacute;vidas, n&atilde;o deixe de conferir. </p>
		<p align="justify" class="style3">A partir daqui, aceito sugest&otilde;es de melhoria e corre&ccedil;&atilde;o, com as seguintes ressalvas:</p>
		<p align="justify" class="style3">- Corre&ccedil;&otilde;es ter&atilde;o prioridade maior que as melhorias.<br />
			- Melhorias ser&atilde;o analisadas, tanto tecnicamente, quando em quest&otilde;es de viabilidade.<br />
			- As tarefas ser&atilde;o feitas conforme a minha disponibilidade de tempo.
		</p>
		<p align="justify" class="style3">E finalizando (finalmente, ufa), futuramente a aplica&ccedil;&atilde;o ser&aacute; totalmente reconstru&iacute;da na plataforma .NET &trade; ou ainda, em JAVA &trade;. At&eacute; o momento eu n&atilde;o decidi qual ser&aacute;, por&eacute;m, at&eacute; l&aacute; eu j&aacute; terei encontrado a melhor solu&ccedil;&atilde;o para isso. Os motivos da reconstru&ccedil;&atilde;o incluem principalmente pelo Visual Basic 6 &trade; j&aacute; estar muito ultrapassado hoje em dia. E como o mundo evolui, temos de evoluir tamb&eacute;m. Todo mundo sabe que, quem anda sempre no mesmo ritmo, cedo ou tarde, acaba ficando pra tr&aacute;s. Enfim, &eacute; isso.</p>
		<p align="justify" class="style3">Espero que goste da aplica&ccedil;&atilde;o.<br />
			E se n&atilde;o gostar, &eacute; simples, &eacute; s&oacute; n&atilde;o usar.
		</p>
		<p align="justify" class="style3">Atenciosamente,<br />
			<strong>Rossano M. Szczepanski</strong><br />
			<strong>Eiko Software</strong>
		</p>
	</body>
</html>