<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
	<head>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
		<title>por Receitas/Despesas</title>
		<style type="text/css">
			<!--
				.style3 {font-family: Tahoma; font-size: 8.5pt; line-height: 1.5;}
				.style6 {font-family: Tahoma; font-size: 8.5pt; font-weight: bold; line-height: 1.5;}
				
				body,td,th {
					font-family: Tahoma;
					font-size: 8.5pt;
					line-height: 1.5;
				}
				a {
					font-family: Tahoma;
					line-height: 1.5;
				}
				-->
		</style>
	</head>
	<body>
		<p align="left" class="style6">por Receitas/Despesas </p>
		<p align="justify" class="style3"><strong>Onde encontrar</strong>:<br />
			<a href="menu_principal.htm">Menu Principal</a> -&gt; <a href="menu_movimentacao.htm">Movimenta&ccedil;&atilde;o</a> -&gt; por Receitas/Despesas.
		</p>
		<p align="justify" class="style3"><strong>Descri&ccedil;&atilde;o</strong>:<br />
			Exibe uma lista de movimenta&ccedil;&atilde;o por Receitas/Despesas de acordo com os filtros selecionados.
		</p>
		<p align="justify" class="style3"><strong>Imagem da tela</strong>:<br />
			<img src="img/movimentacao_por_receitas_despesas.png" />
		</p>
		<p align="justify" class="style3"><strong>Itens da tela </strong>:<br />
			- Filtros: <br />
			&nbsp;&nbsp;&nbsp;&nbsp;- Selecione o tipo: Permite selecionar entre as op&ccedil;&otilde;es Despesas ou Receitas <em></em>.<br />
			&nbsp;&nbsp;&nbsp;&nbsp;- Despesas/Receitas: Permite selecionar apenas uma das Despesas/Receitas cadastradas na aplica&ccedil;&atilde;o.<br />
			&nbsp;&nbsp;&nbsp;&nbsp;- Per&iacute;odo: Define o per&iacute;odo a ser visualizado. <br />
			&nbsp;&nbsp;&nbsp;&nbsp;- Ordenar por: Define o campo que ser&aacute; utilizado para ordena&ccedil;&atilde;o dos resultados.<br />
			&nbsp;&nbsp;&nbsp;&nbsp;- Em ordem: Tipo da ordem, crescente ou decrescente.
			<br />
			- Rodap&eacute;:<br />
			&nbsp;&nbsp;&nbsp;&nbsp;- Total no per&iacute;odo: Exibe a quantidade de resultados e a soma dos valores de acordo com o per&iacute;odo selecionado.<br />
			&nbsp;&nbsp;&nbsp;&nbsp;- Valor m&eacute;dio: Consiste na divis&atilde;o do valor total no per&iacute;odo pela quantidade de resultados no per&iacute;odo selecionado.
		</p>
		<p align="justify" class="style3"><strong>Comandos da tela </strong>:<br />
			Iniciar: Limpa todos os campos da tela retornando a mesma ao seu estado inicial.<br />
			<a href="movimentacao_por_receitas_despesas_detalhes.htm">Detalhes</a>: Abre uma nova tela contendo os detalhes da movimenta&ccedil;&atilde;o selecionada. <br />
			Filtrar: Exibe a lista de movimenta&ccedil;&otilde;es de acordo com os filtros selecionados. <br />
			Fechar: Fecha a janela de Movimenta&ccedil;&atilde;o por Receitas/Despesas.
		</p>
		<p align="justify" class="style3"><strong>Menu de contexto</strong>:<br />
			Lista da movimenta&ccedil;&atilde;o da receita/despesa: Ao clicar com o bot&atilde;o direito do mouse na lista de movimenta&ccedil;&atilde;o da receita/despesa, ser&atilde;o exibidas as seguintes op&ccedil;&otilde;es:<br />
			- Copiar conte&uacute;do: Copia o conte&uacute;do da lista para a &aacute;rea de transfer&ecirc;ncia.<br />
			- Exportar para arquivo: Permite exportar o conte&uacute;do da lista para um arquivo do tipo texto (*.txt) ou csv (*.csv).
		</p>
		<p align="justify" class="style3">  <strong>Observa&ccedil;&otilde;es</strong>:<br />
			- A coluna <strong>diferen&ccedil;a</strong> refere-se &agrave; diferen&ccedil;a de valor comparado do registro atual com o anterior. <br />
			- O campo valor m&eacute;dio cont&eacute;m um resultado aproximado da divis&atilde;o do Total no per&iacute;odo pela Quantidade de Lan&ccedil;amentos.
		</p>
	</body>
</html>